IDEA Open Model
CrossSectionFactory.FillColdFormedRHS Method
Compatible with IDEA StatiCa Beta 20.0
 Fill parameters for cold formed RHS section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillColdFormedRHS(
	CrossSectionParameter css,
	double Height,
	double Width,
	double Thickness,
	double InsideRadius
)
Public Shared Sub FillColdFormedRHS (
	css As CrossSectionParameter,
	Height As Double,
	Width As Double,
	Thickness As Double,
	InsideRadius As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Height
Type: System.Double
Height
Width
Type: System.Double
Width
Thickness
Type: System.Double
Thickness
InsideRadius
Type: System.Double
Inside radius
Remarks
Dimension of cold formed RHS section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 13;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Thickness = 0.005;
double InsideRadius = 0.010;
CrossSectionFactory.FillColdFormedRHS(css, Width, Height, Thickness, InsideRadius);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace